{"name":"Super Evil New Tab Configuration","data":{"bgColor":"#111","html":"<div class=\"container\">\n    <span id=\"quote\" class=\"quote\"></span>\n    <span id=\"source\" class=\"source\"></span>\n</div>","css":"html, body {\n    width: 100%;\n    height: 100%;\n    text-align: center;\n    overflow: hidden;\n    position: relative;\n    background: #0a0a0a;\n    animation: fade-bg .5s ease;\n}\n\n.container {\n    position: absolute;\n    top: 50%;\n    left: 50%;\n    transform: translate(-50%, -50%);\n}\n\n.quote {\n    font-size: 200%;\n    opacity: .3;\n    color: white;\n    display: block;\n    line-height: 1.2;\n    padding-bottom: 1rem;\n    animation: fade-quote .3s ease;\n}\n.source {\n    font-size: 150%;\n    opacity: .25;\n    color: white;\n    animation: fade-source .5s ease;\n}\n\n@keyframes fade-bg {\n    from { background: #111; }\n    to   { background: #0a0a0a; }\n}\n\n\n@keyframes fade-quote {\n    from { opacity: 0; transform: translateY(.375rem); }\n    to   { opacity: .3; transform: translateY(0); }\n}\n\n@keyframes fade-source {\n    from { opacity: 0; transform: translateY(.5rem); }\n    to   { opacity: .25; transform: translateY(0); }\n}\n\n\n","javascript":"var quotes = [\n    ['The impediment to action advances action.<br />What stands in the way becomes the way.', 'Marcus Auerlius'],\n    ['Everything we hear is an opinion, not a fact. Everything we see is a perspective, not the truth.', 'Marcus Aurelius'],\n    ['He who fears death will never do anything worth of a man who is alive.', 'Seneca'],\n    ['The best revenge is not to be like your enemy.', 'Marcus Aurelius'],\n    ['Never let the future disturb you. You will meet it, if you have to, with the same weapons of reason which today arm you against the present.', 'Marcus Aurelius'],\n    ['A gem cannot be polished without friction, nor a man without trials.', 'Seneca'],\n    ['First say to yourself what you would be; and then do what you have to do.', 'Seneca'],\n    ['Think of yourself as dead. You have lived your life. Now, take what’s left and live it properly. What doesn’t transmit light creates its own darkness.', 'Marcus Aurelius'],\n    ['Wherever we are, whatever we’re doing and herever we are going, we owe it to ourselves, to our art, to the world to do it well.', 'Ryan Holiday'],\n    ['It is your own bad strategies, not the unfair opponent, that are to blame for your failures. You are responsible for the good and bad in your life.', 'Robert Greene'],\n    ['It’s not what you preach, it’s what you tolerate.', 'Jocko Willink'],\n    ['Discipline equals freedom.', 'Jocko Willink'],\n    ['Relax. Look around. Make a call.', 'Jocko Willink'],\n    ['Don’t expect to be motivated every day to get out there and make things happen. You won’t be. Don’t count on motivation. Count on Discipline.', 'Jocko Willink'],\n    ['You have to do the work. You have to hold the line. You have to make it happen.', 'Jocko Willink'],\n    ['To implement real change, to drive people to accomplish something truly complex or difficult or dangerous — you can’t make people do these things. You have to lead them.', 'Jocko Willink'],\n    ['Extreme ownership. Leaders must own everything in their world.  There is no one else to blame.', 'Jocko Willink'],\n    ['There are no shortcuts—everything is reps, reps, reps.', 'Arnold Schwarzenegger'],\n    ['There is no need to tell someone how to do his job if you have properly trained your team.', 'Dick Winters'],\n    ['Nothing in this world is worth having or worth doing unless it means effort, pain, difficulty.', 'Theodore Roosevelt'],\n    ['This is the most simple and basic component of life: our struggles determine our successes.', 'Mark Manson'],\n    ['Everything that happens to you is a form of instruction if you pay attention.', 'Robert Greene'],\n    ['The pain is kind of challenge your mind presents - will you learn how to focus and move past boredom, or like a child will you succumb to the need for immediate pleasure and distraction?', 'Robert Greene'],\n    ['No man needs sympathy because he has to work, because he has a burden to carry. Far and away the best prize that life offers is the chance to work hard at work worth doing.', 'Theodore Roosevelt'],\n    ['I shall either find a way or make one.', 'Hannibal'],\n    ['The only way that you’re ever going to get to the other side of this journey is by suffering.  You have to suffer in order to grow.', 'David Goggins'],\n    ['Motivation is crap. Motivation comes and goes. When you’re driven, whatever is in front of you will get destroyed.', 'David Goggins'],\n    ['Everyday is a great day. I have my faith, my family, and live in the finest country in the world.', 'General James Mukoyama'],\n    ['Don’t just think. Don’t just talk. Don’t just dream. None of that matters. The only thing that matters is that you actually do. So: DO.', 'Jocko Willink'],\n    ['Extreme ownership. Leaders must own everything in their world. There is no one else to blame.', 'Jocko Willink'],\n    ['Remember that if you don’t prioritize your life someone else will.', 'Greg Mckeown'],\n    ['But until a person can say deeply and honestly, \"I am what I am today because of the choices I made yesterday,\" that person cannot say, \"I choose otherwise.\"', 'Stephen R. Covey'],\n    ['You have to take great pleasure in the fact that no one wants to be where you are at right now. It has to bring passion out of you.', 'David Goggins'],\n    ['It doesn’t have to be fun. It has to be effective.', 'David Goggins'],\n    ['If you can make one heap of all your winning and risk it on one turn of pitch-and-toss, and lose, and start again at your beginnings and never breathe a word about your loss', 'Rudyard Kipling'],\n    ['Improving daily work is even more important than doing daily work.', 'Gene Kim'],\n    ['When you realize the story you\\'re telling is just words, when you can just crumble up and throw your past in the trashcan, then we\\'ll figure out who you\\'re going to be.', 'Chuck Palahniuk'],\n    ['The purpose of life is finding the largest burden that you can bear and bearing it.', 'Jordan Peterson'],\n    ['You\\'re going to pay a price for every bloody thing you do and everything you don\\'t do. You don\\'t get to choose to not pay a price. You get to choose which poison you\\'re going to take. That\\'s it.', 'Jordan Peterson'],\n    ['I don\\'t tell people, \"You\\'re okay the way that you are.\" That\\'s not the right story. The right story is, \"You\\'re way less than you could be.\"', 'Jordan Peterson']\n];\n\nvar quoteofday = quotes[Math.floor(Math.random()*quotes.length)];\n\ndocument.getElementById('quote').innerHTML = quoteofday[0];\ndocument.getElementById('source').innerHTML = quoteofday[1];\n"}}
